app/Providers/AuthServiceProvider.php

    public function boot()
    {
        $this->registerPolicies();
		\Gate::define('quarx', function ($user) {
			return ($user->roles->first()->name === 'admin');
		});
		\Gate::define('admin', function ($user) {
			return ($user->roles->first()->name === 'admin');
		});
		\Gate::define('quarx', function ($user) {
			return ($user->roles->first()->name === 'admin');
		});
		\Gate::define('admin', function ($user) {
			return ($user->roles->first()->name === 'admin');
		});
		\Gate::define('quarx', function ($user) {
			return ($user->roles->first()->name === 'admin');
		});
		\Gate::define('admin', function ($user) {
			return ($user->roles->first()->name === 'admin');
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = '1'